Lotlab/nrf51822-keyboard/main.c
/** @snippet [DFU BLE Reset prepare] */
/**@brief Function for preparing for system reset.
 *
 * @details This function implements @ref dfu_app_reset_prepare_t. It will be called by 
 *          @ref dfu_app_handler.c before entering the bootloader/DFU.
 *          This allows the current running application to shut down gracefully.
 */
static void reset_prepare(void)
{
    uint32_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Disconnect from peer.
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // If not connected, the device will be advertising. Hence stop the advertising.
        advertising_stop();
    }

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);

    nrf_delay_ms(500);
}

static void dfu_init(void)
{
    uint32_t err_code;
    ble_dfu_init_t dfus_init;

    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    dfus_init.evt_handler = dfu_app_on_dfu_evt;
    dfus_init.error_handler = NULL;
    dfus_init.evt_handler = dfu_app_on_dfu_evt;
    dfus_init.revision = DFU_REVISION;

    err_code = ble_dfu_init(&m_dfus, &dfus_init);
    APP_ERROR_CHECK(err_code);

    dfu_app_reset_prepare_set(reset_prepare);
    dfu_app_dm_appl_instance_set(m_app_handle);
}
/** @snippet [DFU BLE Reset prepare] */
#endif // BLE_DFU_APP_SUPPORT

/**@brief 初始化程序所需的服务
 */
static void services_init(void)
{
    dis_init();
    bas_init();
    hids_init();
#ifdef BLE_DFU_APP_SUPPORT
    dfu_init();
#endif // BLE_DFU_APP_SUPPORT
}

/**@brief 初始化电量测量ADC
 */
static void battery_sensor_init(void)
{
    // Todo: add some code here!
    nrf_adc_config_t nrf_adc_config = {NRF_ADC_CONFIG_RES_10BIT,                // 10Bit 精度
                                       NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE, // 完整输入
                                       NRF_ADC_CONFIG_REF_VBG};                 // 内置 1.2V 基准

    // Initialize and configure ADC
    nrf_adc_configure((nrf_adc_config_t *)&nrf_adc_config);
    nrf_adc_input_select(KEYBOARD_ADC);
    nrf_adc_int_enable(ADC_INTENSET_END_Enabled << ADC_INTENSET_END_Pos);
    NVIC_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_LOW);
    NVIC_EnableIRQ(ADC_IRQn);
}

/**
 * @brief ADC 测量数据Handler
 */
void ADC_IRQHandler(void)
{
    nrf_adc_conversion_event_clean();
    adc_cycle++;
    adc_sample_temp += nrf_adc_result_get();
    if (adc_cycle >= 5)
    {
        adc_sample = adc_sample_temp / 5;
        adc_sample_temp = 0;
        adc_cycle = 0;
    }
    else
    {
        nrf_adc_start();
    }
}

static void led_notice(void)
{
    nrf_gpio_pin_set(LED_NUM);
    nrf_gpio_pin_set(LED_CAPS);
    nrf_gpio_pin_set(LED_SCLK);
    nrf_delay_ms(100);
    nrf_gpio_pin_clear(LED_NUM);
    nrf_gpio_pin_clear(LED_CAPS);
    nrf_gpio_pin_clear(LED_SCLK);
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail = false;
    cp_init.evt_handler = NULL;
    cp_init.error_handler = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief 计时器启动函数
 */
static void timers_start(void)
{
    uint32_t err_code;

    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_SEND_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_battery_timer_meas_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_keyboard_scan_timer_id, KEYBOARD_SCAN_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief   Function for transmitting a key scan Press & Release Notification.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_instance     Identifies the service for which Key Notifications are requested.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern. 0 < pattern_len < 7.
 * @param[in]  pattern_offset Offset applied to Key Pattern for transmission.
 * @param[out] actual_len     Provides actual length of Key Pattern transmitted, making buffering of
 *                            rest possible if needed.
 * @return     NRF_SUCCESS on success, BLE_ERROR_NO_TX_BUFFERS in case transmission could not be
 *             completed due to lack of transmission buffer or other error codes indicating reason
 *             for failure.
 *
 * @note       In case of BLE_ERROR_NO_TX_BUFFERS, remaining pattern that could not be transmitted
 *             can be enqueued \ref buffer_enqueue function.
 *             In case a pattern of 'cofFEe' is the p_key_pattern, with pattern_len as 6 and
 *             pattern_offset as 0, the notifications as observed on the peer side would be
 *             1>    'c', 'o', 'f', 'F', 'E', 'e'
 *             2>    -  , 'o', 'f', 'F', 'E', 'e'
 *             3>    -  ,   -, 'f', 'F', 'E', 'e'
 *             4>    -  ,   -,   -, 'F', 'E', 'e'
 *             5>    -  ,   -,   -,   -, 'E', 'e'
 *             6>    -  ,   -,   -,   -,   -, 'e'
 *             7>    -  ,   -,   -,   -,   -,  -
 *             Here, '-' refers to release, 'c' refers to the key character being transmitted.
 *             Therefore 7 notifications will be sent.
 *             In case an offset of 4 was provided, the pattern notifications sent will be from 5-7
 *             will be transmitted.
 */
static uint32_t send_key_scan_press_release(ble_hids_t *p_hids,
                                            uint8_t *p_key_pattern,
                                            uint16_t pattern_len,
                                            uint16_t pattern_offset,
                                            uint16_t *p_actual_len)
{
    uint32_t err_code;
    /**
    uint16_t offset;
    uint16_t data_len;
    uint8_t  data[INPUT_REPORT_KEYS_MAX_LEN];
    
    // HID Report Descriptor enumerates an array of size 6, the pattern hence shall not be any
    // longer than this.
    STATIC_ASSERT((INPUT_REPORT_KEYS_MAX_LEN - 2) == 6);

    ASSERT(pattern_len <= (INPUT_REPORT_KEYS_MAX_LEN - 2));

    offset = 0;

    for(int i=0;i< pattern_len - pattern_offset; i++)
    {
        if(p_key_pattern[i+pattern_offset]>=KC_LCTL && p_key_pattern[i+pattern_offset]<=KC_RGUI)
        {
            data[MODIFIER_KEY_POS] |= 1 << (p_key_pattern[i+pattern_offset] - KC_LCTL);
        }
        else
        {
            data[SCAN_CODE_POS+offset] = p_key_pattern[i+pattern_offset];
            offset++;
        }
    }
    
    if (!m_in_boot_mode)
    {
        err_code = ble_hids_inp_rep_send(p_hids, 
                                            INPUT_REPORT_KEYS_INDEX,
                                            INPUT_REPORT_KEYS_MAX_LEN,
                                            data);
    }
    else
    {
        err_code = ble_hids_boot_kb_inp_rep_send(p_hids,
                                                    INPUT_REPORT_KEYS_MAX_LEN,
                                                    data);
    }
     *p_actual_len = offset;
    **/
    for (int i = 0; i < pattern_len; i++)
    {
        switch (p_key_pattern[i])
        {
        case KC_NUMLOCK:
            m_led_state[OUTPUT_REPORT_BIT_MASK_NUM_LOCK] = !m_led_state[OUTPUT_REPORT_BIT_MASK_NUM_LOCK];
            nrf_gpio_pin_toggle(LED_NUM);
            break;
        case KC_CAPSLOCK:
            m_led_state[OUTPUT_REPORT_BIT_MASK_CAPS_LOCK] = !m_led_state[OUTPUT_REPORT_BIT_MASK_CAPS_LOCK];
            nrf_gpio_pin_toggle(LED_CAPS);
            break;
        case KC_SCROLLLOCK:
            m_led_state[OUTPUT_REPORT_BIT_MASK_SCROLL_LOCK] = !m_led_state[OUTPUT_REPORT_BIT_MASK_SCROLL_LOCK];
            nrf_gpio_pin_toggle(LED_SCLK);
            break;
        default:
            break;
        }
    }
    if (!m_in_boot_mode)
    {
        err_code = ble_hids_inp_rep_send(&m_hids,
                                         INPUT_REPORT_KEYS_INDEX,
                                         INPUT_REPORT_KEYS_MAX_LEN,
                                         p_key_pattern);
    }
    else
    {
        err_code = ble_hids_boot_kb_inp_rep_send(&m_hids,
                                                 INPUT_REPORT_KEYS_MAX_LEN,
                                                 p_key_pattern);
    }

    return err_code;
}

/**@brief   Function for initializing the buffer queue used to key events that could not be
 *          transmitted
 *
 * @warning This handler is an example only. You need to analyze how you wish to buffer or buffer at
 *          all.
 *
 * @note    In case of HID keyboard, a temporary buffering could be employed to handle scenarios
 *          where encryption is not yet enabled or there was a momentary link loss or there were no
 *          Transmit buffers.
 */
static void buffer_init(void)
{
    uint32_t buffer_count;

    BUFFER_LIST_INIT();

    for (buffer_count = 0; buffer_count < MAX_BUFFER_ENTRIES; buffer_count++)
    {
        BUFFER_ELEMENT_INIT(buffer_count);
    }
}

/**@brief Function for enqueuing key scan patterns that could not be transmitted either completely
 *        or partially.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_hids         Identifies the service for which Key Notifications are buffered.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern.
 * @param[in]  offset         Offset applied to Key Pattern when requesting a transmission on
 *                            dequeue, @ref buffer_dequeue.
 * @return     NRF_SUCCESS on success, else an error code indicating reason for failure.
 */
static uint32_t buffer_enqueue(ble_hids_t *p_hids,
                               uint8_t *p_key_pattern,
                               uint16_t pattern_len,
                               uint16_t offset)
{
    buffer_entry_t *element;
    uint32_t err_code = NRF_SUCCESS;

